{"backend": "tensorflow", "config": {"input_layers": [["input_1", 0, 0], ["input_2", 0, 0]], "layers": [{"config": {"dtype": "float32", "batch_input_shape": [null, 51, 51, 25], "sparse": false, "name": "input_1"}, "class_name": "InputLayer", "inbound_nodes": [], "name": "input_1"}, {"config": {"dtype": "float32", "batch_input_shape": [null, 11, 11, 60], "sparse": false, "name": "input_2"}, "class_name": "InputLayer", "inbound_nodes": [], "name": "input_2"}, {"config": {"name": "reshape_1", "target_shape": [51, 51, 25, 1], "trainable": true}, "class_name": "Reshape", "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "reshape_1"}, {"config": {"name": "reshape_2", "target_shape": [11, 11, 60, 1], "trainable": true}, "class_name": "Reshape", "inbound_nodes": [[["input_2", 0, 0, {}]]], "name": "reshape_2"}, {"config": {"activation": "relu", "dilation_rate": [1, 1, 1], "strides": [1, 1, 1], "filters": 3, "use_bias": true, "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "padding": "valid", "name": "conv3d_1", "kernel_size": [4, 4, 4], "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv3D", "inbound_nodes": [[["reshape_1", 0, 0, {}]]], "name": "conv3d_1"}, {"config": {"activation": "relu", "dilation_rate": [1, 1, 1], "strides": [1, 1, 1], "filters": 10, "use_bias": true, "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "padding": "valid", "name": "conv3d_2", "kernel_size": [2, 2, 6], "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv3D", "inbound_nodes": [[["reshape_2", 0, 0, {}]]], "name": "conv3d_2"}, {"config": {"padding": "valid", "name": "max_pooling3d_1", "strides": [2, 2, 2], "pool_size": [2, 2, 2], "data_format": "channels_last", "trainable": true}, "class_name": "MaxPooling3D", "inbound_nodes": [[["conv3d_1", 0, 0, {}]]], "name": "max_pooling3d_1"}, {"config": {"padding": "valid", "name": "max_pooling3d_2", "strides": [2, 2, 2], "pool_size": [2, 2, 2], "data_format": "channels_last", "trainable": true}, "class_name": "MaxPooling3D", "inbound_nodes": [[["conv3d_2", 0, 0, {}]]], "name": "max_pooling3d_2"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten", "inbound_nodes": [[["max_pooling3d_1", 0, 0, {}]]], "name": "flatten_1"}, {"config": {"name": "flatten_2", "trainable": true}, "class_name": "Flatten", "inbound_nodes": [[["max_pooling3d_2", 0, 0, {}]]], "name": "flatten_2"}, {"config": {"dot_axes": -1, "output_shape_type": "raw", "mode_type": "raw", "name": "merge_1", "concat_axis": -1, "output_mask_type": "raw", "output_shape": null, "output_mask": null, "mode": "concat", "arguments": {}}, "class_name": "Merge", "inbound_nodes": [[["flatten_1", 0, 0, {"mask": [null, null]}], ["flatten_2", 0, 0, {"mask": [null, null]}]]], "name": "merge_1"}, {"config": {"activation": "relu", "units": 1000, "use_bias": true, "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "name": "dense_1", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense", "inbound_nodes": [[["merge_1", 0, 0, {}]]], "name": "dense_1"}, {"config": {"name": "dropout_1", "rate": 0.5, "trainable": true}, "class_name": "Dropout", "inbound_nodes": [[["dense_1", 0, 0, {}]]], "name": "dropout_1"}, {"config": {"activation": "linear", "units": 1, "use_bias": true, "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "name": "energy", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense", "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "name": "energy"}], "name": "model_1", "output_layers": [["energy", 0, 0]]}, "class_name": "Model", "keras_version": "2.0.6"}